x_273492_choreszer/update/sys_soap_message_function_43eff611db5d330029ee14613996198e.xml

<?xml version="1.0" encoding="UTF-8"?><record_update table="sys_soap_message_function">
    <sys_soap_message_function action="INSERT_OR_UPDATE">
        <authentication_type/>
        <basic_auth_password/>
        <basic_auth_profile/>
        <basic_auth_user/>
        <certificate/>
        <enable_mutual_auth>false</enable_mutual_auth>
        <envelope><![CDATA[<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:inc="http://www.service-now.com/incident">
   <soapenv:Header/>
   <soapenv:Body>
      <inc:update>
         <!--Optional:-->
         <active>${update.active}</active>
         <!--Optional:-->
         <activity_due>${update.activity_due}</activity_due>
         <!--Optional:-->
         <additional_assignee_list>${update.additional_assignee_list}</additional_assignee_list>
         <!--Optional:-->
         <approval>${update.approval}</approval>
         <!--Optional:-->
         <approval_history>${update.approval_history}</approval_history>
         <!--Optional:-->
         <approval_set>${update.approval_set}</approval_set>
         <!--Optional:-->
         <assigned_to>${update.assigned_to}</assigned_to>
         <!--Optional:-->
         <assignment_group>${update.assignment_group}</assignment_group>
         <!--Optional:-->
         <business_duration>${update.business_duration}</business_duration>
         <!--Optional:-->
         <business_service>${update.business_service}</business_service>
         <!--Optional:-->
         <business_stc>${update.business_stc}</business_stc>
         <!--Optional:-->
         <calendar_duration>${update.calendar_duration}</calendar_duration>
         <!--Optional:-->
         <calendar_stc>${update.calendar_stc}</calendar_stc>
         <!--Optional:-->
         <caller_id>${update.caller_id}</caller_id>
         <!--Optional:-->
         <category>${update.category}</category>
         <!--Optional:-->
         <caused_by>${update.caused_by}</caused_by>
         <!--Optional:-->
         <child_incidents>${update.child_incidents}</child_incidents>
         <!--Optional:-->
         <close_code>${update.close_code}</close_code>
         <!--Optional:-->
         <close_notes>${update.close_notes}</close_notes>
         <!--Optional:-->
         <closed_at>${update.closed_at}</closed_at>
         <!--Optional:-->
         <closed_by>${update.closed_by}</closed_by>
         <!--Optional:-->
         <cmdb_ci>${update.cmdb_ci}</cmdb_ci>
         <!--Optional:-->
         <comments>${update.comments}</comments>
         <!--Optional:-->
         <comments_and_work_notes>${update.comments_and_work_notes}</comments_and_work_notes>
         <!--Optional:-->
         <company>${update.company}</company>
         <!--Optional:-->
         <contact_type>${update.contact_type}</contact_type>
         <!--Optional:-->
         <correlation_display>${update.correlation_display}</correlation_display>
         <!--Optional:-->
         <correlation_id>${update.correlation_id}</correlation_id>
         <!--Optional:-->
         <delivery_plan>${update.delivery_plan}</delivery_plan>
         <!--Optional:-->
         <delivery_task>${update.delivery_task}</delivery_task>
         <!--Optional:-->
         <description>${update.description}</description>
         <!--Optional:-->
         <due_date>${update.due_date}</due_date>
         <!--Optional:-->
         <escalation>${update.escalation}</escalation>
         <!--Optional:-->
         <expected_start>${update.expected_start}</expected_start>
         <!--Optional:-->
         <follow_up>${update.follow_up}</follow_up>
         <!--Optional:-->
         <group_list>${update.group_list}</group_list>
         <!--Optional:-->
         <hold_reason>${update.hold_reason}</hold_reason>
         <!--Optional:-->
         <impact>${update.impact}</impact>
         <!--Optional:-->
         <incident_state>${update.incident_state}</incident_state>
         <!--Optional:-->
         <knowledge>${update.knowledge}</knowledge>
         <!--Optional:-->
         <location>${update.location}</location>
         <!--Optional:-->
         <made_sla>${update.made_sla}</made_sla>
         <!--Optional:-->
         <notify>${update.notify}</notify>
         <!--Optional:-->
         <number>${update.number}</number>
         <!--Optional:-->
         <opened_at>${update.opened_at}</opened_at>
         <!--Optional:-->
         <opened_by>${update.opened_by}</opened_by>
         <!--Optional:-->
         <order>${update.order}</order>
         <!--Optional:-->
         <parent>${update.parent}</parent>
         <!--Optional:-->
         <parent_incident>${update.parent_incident}</parent_incident>
         <!--Optional:-->
         <priority>${update.priority}</priority>
         <!--Optional:-->
         <problem_id>${update.problem_id}</problem_id>
         <!--Optional:-->
         <reassignment_count>${update.reassignment_count}</reassignment_count>
         <!--Optional:-->
         <reopen_count>${update.reopen_count}</reopen_count>
         <!--Optional:-->
         <reopened_by>${update.reopened_by}</reopened_by>
         <!--Optional:-->
         <reopened_time>${update.reopened_time}</reopened_time>
         <!--Optional:-->
         <resolved_at>${update.resolved_at}</resolved_at>
         <!--Optional:-->
         <resolved_by>${update.resolved_by}</resolved_by>
         <!--Optional:-->
         <rfc>${update.rfc}</rfc>
         <!--Optional:-->
         <severity>${update.severity}</severity>
         <!--Optional:-->
         <short_description>${update.short_description}</short_description>
         <!--Optional:-->
         <sla_due>${update.sla_due}</sla_due>
         <!--Optional:-->
         <state>${update.state}</state>
         <!--Optional:-->
         <subcategory>${update.subcategory}</subcategory>
         <sys_id>${update.sys_id}</sys_id>
         <!--Optional:-->
         <time_worked>${update.time_worked}</time_worked>
         <!--Optional:-->
         <upon_approval>${update.upon_approval}</upon_approval>
         <!--Optional:-->
         <upon_reject>${update.upon_reject}</upon_reject>
         <!--Optional:-->
         <urgency>${update.urgency}</urgency>
         <!--Optional:-->
         <user_input>${update.user_input}</user_input>
         <!--Optional:-->
         <watch_list>${update.watch_list}</watch_list>
         <!--Optional:-->
         <work_end>${update.work_end}</work_end>
         <!--Optional:-->
         <work_notes>${update.work_notes}</work_notes>
         <!--Optional:-->
         <work_notes_list>${update.work_notes_list}</work_notes_list>
         <!--Optional:-->
         <work_start>${update.work_start}</work_start>
      </inc:update>
   </soapenv:Body>
</soapenv:Envelope>]]></envelope>
        <function_name>update</function_name>
        <key_store/>
        <key_store_alias/>
        <key_store_password/>
        <lock>false</lock>
        <protocol_profile/>
        <qualified_name>tset [ update ]</qualified_name>
        <soap_action>http://www.service-now.com/incident/update</soap_action>
        <soap_endpoint>https://dev65161.service-now.com/incident.do?SOAP</soap_endpoint>
        <soap_message display_value="tset">fe7fb211db5d330029ee146139961962</soap_message>
        <strip_whitespace>false</strip_whitespace>
        <sys_class_name>sys_soap_message_function</sys_class_name>
        <sys_created_by>admin</sys_created_by>
        <sys_created_on>2019-05-08 05:16:43</sys_created_on>
        <sys_id>43eff611db5d330029ee14613996198e</sys_id>
        <sys_mod_count>0</sys_mod_count>
        <sys_name>update</sys_name>
        <sys_package display_value="ChoresZero" source="x_273492_choreszer">b6c704dddb55330029ee146139961928</sys_package>
        <sys_policy/>
        <sys_scope display_value="ChoresZero">b6c704dddb55330029ee146139961928</sys_scope>
        <sys_update_name>sys_soap_message_function_43eff611db5d330029ee14613996198e</sys_update_name>
        <sys_updated_by>admin</sys_updated_by>
        <sys_updated_on>2019-05-08 05:16:43</sys_updated_on>
        <use_basic_auth>false</use_basic_auth>
        <use_mid_server/>
        <use_ws_security>false</use_ws_security>
        <ws_security_type/>
        <ws_security_username_profile/>
        <ws_security_x509_profile/>
    </sys_soap_message_function>
</record_update>
